Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceNdfType
The property labeled "NDF" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "SurfaceNdfType".
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceRoughness
The property labeled "Roughness" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceRotation
The property labeled "Rotation" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceCutout
The property labeled "Image" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceNormal
The property labeled "Image" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceAnisotropy
The property labeled "Anisotropy" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceAlbedo
The property labeled "Color" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingBackfaceCulling
The property labeled "Backface Culling" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingF0
The property labeled "Reflective Color" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingTransmissionRoughness
The property labeled "Transmissive roughness" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyDouble".
This property allows a connected asset.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing.GlazingTransmissionColor
The property labeled "Transmissive color" from the "PrismGlazing" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018

Autodesk.Revit.DB.Visual.AdvancedGlazing
Represents the properties of materials.
Since:
2018